Witali/HLV-codec/firmware/esp32_2432s028_hlv_player_baremetal/sdkconfig.defaults
# ESP32-2432S028 (original ESP32, 4 MiB QIO flash, no PSRAM)
CONFIG_IDF_TARGET="esp32"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_MONITOR_BAUD=460800
CONFIG_ESPTOOLPY_BEFORE_RESET=y
CONFIG_ESPTOOLPY_AFTER_RESET=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_HLV_PLAYER_DISPLAY_SPI_CLOCK_MHZ=80
CONFIG_HLV_PLAYER_SD_SPI_CLOCK_MHZ=40

# Keep the scheduler as a minimal two-core microkernel. ESP-IDF pins app_main
# (control, SD I/O and rendering) to PRO CPU; the player explicitly pins its
# sole decoder worker to APP CPU.
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_UNICORE=n
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y
CONFIG_ESP_SYSTEM_ALLOW_RTC_FAST_MEM_AS_HEAP=n
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_DISABLE=y
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n
CONFIG_LIBC_NEWLIB_NANO_FORMAT=y

# UART remains only for boot and fatal-error diagnostics. The application UART
# protocol and per-frame timing stream are disabled by the build profile.
CONFIG_LOG_DEFAULT_LEVEL_ERROR=y
CONFIG_LOG_MAXIMUM_EQUALS_DEFAULT=y
CONFIG_BOOTLOADER_LOG_LEVEL_ERROR=y
CONFIG_ESP_CONSOLE_UART_CUSTOM=y
CONFIG_ESP_CONSOLE_UART_CUSTOM_NUM_0=y
CONFIG_ESP_CONSOLE_UART_TX_GPIO=1
CONFIG_ESP_CONSOLE_UART_RX_GPIO=3
CONFIG_ESP_CONSOLE_UART_BAUDRATE=460800

CONFIG_ESP_TASK_WDT_EN=n
CONFIG_FREERTOS_USE_TRACE_FACILITY=n
CONFIG_FREERTOS_GENERATE_RUN_TIME_STATS=n
CONFIG_FREERTOS_USE_TIMERS=n
CONFIG_HEAP_POISONING_DISABLED=y

CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=63
CONFIG_FATFS_VOLUME_COUNT=1
CONFIG_FATFS_SECTOR_512=y
CONFIG_FATFS_FS_LOCK=0
CONFIG_FATFS_PER_FILE_CACHE=y
CONFIG_FATFS_USE_FASTSEEK=y
CONFIG_FATFS_FAST_SEEK_BUFFER_SIZE=64
CONFIG_FATFS_USE_STRFUNC_NONE=y

CONFIG_VFS_SUPPORT_IO=y
# Console/runtime consume two registrations before the SD card is mounted;
# the third slot is required by FatFs.
CONFIG_VFS_MAX_COUNT=3
CONFIG_VFS_SUPPORT_DIR=y
CONFIG_VFS_SUPPORT_SELECT=n
CONFIG_VFS_SUPPORT_TERMIOS=n
CONFIG_VFS_INITIALIZE_DEV_NULL=n

# Decoder open paths and FatFs calls require this headroom even though no
# separate application stacks are allocated.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000
